[
  {
    "company": "GreenShield",
    "title": "QA Automation Engineer III",
    "startDate": "Jan 2024",
    "endDate": "Present",
    "descriptionItems": [
      "Architected a highly configurable test automation framework for our Mental Health product, using JSON toselect validations dynamically.",
      "Took ownership of the Practitioner Portal QA, conducted regular analysis, and reduced regression testingtime from 12 to 6 hours by collaboratively rewriting the regression suite to follow a more efficient flow.",
      "Documented our collaborations with development and QA teams, promoting use of consistent test identifiers, configurable test frameworks for multiple languages, and white-label clients."
    ],
    "skills": [
      "Cypress",
      "Java",
      "Selenium",
      "GitHub Actions",
      "Docker",
      "Test Automation",
      "Manual Testing"
    ],
    "companyUrl": "/assets/image/greenshield_logo.jpeg"
  },
  {
    "company": "Glovee",
    "title": "Software Engineer - Co-Founder",
    "startDate": "Sep 2023",
    "endDate": "Present",
    "descriptionItems": [
      "Led a 3-person team through product discovery and development, building a CRM for immigration consultants to centralize client management and communication.",
      "Built a modular monolith backend using Golang and PL/pgSQL, and developed a form template builder with NextJS and browser APIs.",
      "Refactored the frontend through reusable components, reducing code duplication, tightening form validation, and optimizing search functionality."
    ],
    "skills": [
      "React",
      "TypeScript",
      "Go",
      "PostgreSQL",
      "Product Management",
      "Strategic Planning"
    ],
    "companyUrl": "/assets/image/glovee_logo.jpeg"
  },
  {
    "company": "QA Consultants",
    "title": "QA Automation Engineer",
    "startDate": "Mar 2023",
    "endDate": "Dec 2023",
    "descriptionItems": [
      "Enhanced efficiency by developing robust automation frameworks using Selenium and Cypress.",
      "Integrated frameworks with GitHub Actions, Jenkins, and Docker for CI/CD.",
      "Increased test coverage and adherence to quality standards by creating and executing comprehensive test plans."
    ],
    "skills": [
      "Python",
      "Selenium",
      "Cypress",
      "Postman",
      "JMeter",
      "GitHub Actions",
      "Jenkins",
      "Test Automation"
    ],
    "companyUrl": "/assets/image/qa_consultants_logo.jpeg"
  },
  {
    "company": "Yuhu Inc.",
    "title": "Software Engineer Intern",
    "startDate": "Apr 2022",
    "endDate": "Oct 2022",
    "descriptionItems": [
      "Optimized codebase by building functions to handle common query combinations and PDF mapping, resulting in enhanced consistency, speeding up customer onboarding, and reducing files from 1000+ to under 300 lines.",
      "Onboarded multi-family properties by implementing their lease agreements in Rails modules, handled code reviews and bug fixes and worked with onboarding specialists to improve reliability and resolve customer issues."
    ],
    "skills": [
      "Ruby on Rails",
      "JavaScript",
      "React",
      "SQL",
      "MongoDB",
      "Git",
      "Linux",
      "CircleCI",
      "Docker",
      "Jira"
    ],
    "companyUrl": "/assets/image/yuhu_inc_logo.jpeg"
  },
  {
    "company": "Independent Contractor (Freelance)",
    "title": "Financial Portfolio Manager",
    "startDate": "Mar 2018",
    "endDate": "Jan 2021",
    "descriptionItems": [
      "Financial analysis based on macroeconomic factors, government policies, and market behavior.",
      "Developed risk management strategies using technical and fundamental analysis, and financial derivatives.",
      "Collaborated with investment managers to create an options trading arbitrage algorithm."
    ],
    "skills": [
      "Portfolio Management",
      "Python",
      "NumPy",
      "Data Analysis",
      "Financial Analysis"
    ],
    "companyUrl": "/assets/image/default_company_logo.png"
  }
]
